Docs/Reference/Content/images/dependencies/net8.0/d2/alloverit-validation.d2
direction: left

aoi: AllOverIt
aoi.alloverit-validation: AllOverIt.Validation
fluentvalidation_12-1-1: FluentValidation\nv12.1.1
microsoft-extensions-dependencyinjection-abstractions_10-0-9: Microsoft.Extensions.DependencyInjection.Abstractions\nv10.0.9
aoi.alloverit: AllOverIt
aoi.alloverit-assertion: AllOverIt.Assertion
fluentvalidation_12-1-1 <- aoi.alloverit-validation
microsoft-extensions-dependencyinjection-abstractions_10-0-9 <- aoi.alloverit-validation
aoi.alloverit <- aoi.alloverit-validation
aoi.alloverit-assertion <- aoi.alloverit
fluentvalidation_12-1-1.style.fill: "#ADD8E6"
fluentvalidation_12-1-1.style.opacity: 0.8
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.fill: "#ADD8E6"
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.opacity: 0.8
aoi.style.fill: "#E7EBFC"
aoi.style.opacity: 1
